Public Attributes | List of all members
API_AnalyticalPlaneSurface Struct Reference
Analytical Model
TBD. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
 API_Coord3D  | basePoint
The base point of the plane surface.
 API_Vector3D  | normalVector
The normal vector of the plane surface.
Detailed Description
TBD.
Since
Archicad 24